[
  {
    "slug": "20260110",
    "title": "Untitled",
    "date": "2026-01-10",
    "tags": [],
    "excerpt": "",
    "content": "<ul>\n<li>Currently writing my PhD thesis. I expect to submit it in late spring and to do my PhD viva (defence) in summer. My UK visa will expire after that so in spring I&#39;ll start looking for roles in Canada (Montreal/Toronto area).</li>\n<li>In November I started a Research Fellow part-time role at the <a href=\"https://musicairesearch.wordpress.com/\">Music &amp; Artificial Intelligence: Building Critical Interdisciplinary Studies</a> (MusAI) ERC project, led by <a href=\"https://profiles.ucl.ac.uk/15934-georgina-born\">Prof Georgina Born</a>. I&#39;m working on the &quot;Prototyping Radically Interdisciplinary Music AI Pedagogies&quot; work package, led by <a href=\"https://researchers.arts.ac.uk/1594-rebecca-fiebrink\">Prof Rebecca Fiebrink</a> at the <a href=\"https://www.arts.ac.uk/creative-computing-institute\">Creative Computing Institute</a>. I&#39;m very excited about this first post-doc role as it allows me to continue working on the STS angle of music technology that I&#39;ve very much enjoyed during my thesis.</li>\n<li>In September I submitted my last PhD journal paper (fingers crossed!) on my collaboration with <a href=\"https://www.adampultz.com/about.html\">Adam Pultz Melbye</a>, more info in the <a href=\"'/projects'\">project page</a>. [Update: it&#39;s been accepted!! will release a preprint soon]</li>\n<li>This last autumn semester I taught Coding for Digital Media at the <a href=\"https://www.arts.ac.uk/subjects/creative-computing/postgraduate/msc-applied-machine-learning-for-creatives\">MSc Applied ML for Creatives</a> (Creative Computing Institute, University of the Arts, London). I was also invited to teach a 4h class in the <a href=\"https://www.arts.ac.uk/subjects/creative-computing/postgraduate/mres-creative-computing\">MRes Creative Computing</a> on STS and HCI.</li>\n<li>Because my @qmul.ac.uk email account will expire at some point in the near future, I created a personal email account at <a href=\"mailto:hi@teresapelinski.com\">hi@teresapelinski.com</a> (do I present techy enough if my personal email account ends in @gmail.com?). I think it was wise not to attempt to self-host my email account; I&#39;m using <a href=\"https://www.zoho.com/mail/\">Zoho</a>, the cheapest provider (£14.40/year, 10GB hosting) I could find that didn&#39;t look too dodgy.</li>\n</ul>\n",
    "lastModified": 1768068688762
  }
]