[
  {
    "slug": "20251008",
    "title": "Untitled",
    "date": "2025-10-08",
    "tags": [],
    "excerpt": "",
    "content": "<h1>Work</h1>\n<ul>\n<li>I submitted my last PhD journal paper last week (fingers crossed!) on my collaboration with Adam Pultz Melbye, so I am now fully committed to writing my thesis. Most chapters are drafted</li>\n<li>This semester I&#39;m also teaching Coding for Digital Media at the MSc Applied ML for Creatives (Creative Computing Institute, University of the Arts, London). I&#39;ll also be teaching a 4h class in the MRes Creative Computing, I&#39;ve been invited by the great Dr Elizabeth Wilson</li>\n<li>I might also start another PT research gig soon... more info on that later...</li>\n</ul>\n<h1>Not-work</h1>\n<ul>\n<li>One would think the self-hosting fever was temporary – it&#39;s not. My last addition to my *rr stack is the supposedly dead <a href=\"https://readarr.com/\">Readarr</a> using <a href=\"https://github.com/blampe/rreading-glasses\">rreading-glasses</a> as replacement for the former metadata service. For listening to the audiobooks I&#39;m hosting <a href=\"https://www.audiobookshelf.org/\">audiobookshelf</a>. I also joined my first private tracker ;) My next items on the list are replacing Cloudflare tunnels by <a href=\"https://github.com/fosrl/pangolin\">Pangolin</a>, I don&#39;t want my port forwarding managed by a US-based company... in this time and age! And backing up my Raspberry Pi SD cards.....</li>\n<li>Re the audiobooks... why did I have this apprehension to listening to books? I was worried I was cheating my yearly Goodreads book count by adding the audiobooks I&#39;ve listening. I&#39;ve been trying (emphasis on trying) to do more exercise. My problem with exercising is that I get bored, for this football is fun, but I can&#39;t be playing football every day. The audiobooks have helped a lot with making my visits to the gym as short as needed (a full routine under 1h!) and to get me walking to places. So far I&#39;ve been listening to the audiobooks offered by my local library but to be fair, the good ones have a long waiting list.</li>\n<li>Reading the second book of the Three Body Problem trilogy, which my friend J (who just had a baby! hi to the baby!) lent me. I loved the first book, the fact that it is &quot;plausible&quot; science fiction (or speculative, science-backed science fiction?). What I did not like about doing physics in university is how sterile and dry it was. I understand that there is not much imagination involved in a Physics undergraduate but...... how can one remember anything if everything is already there, dry and dull... that&#39;s probably why I myself don&#39;t remember a thing from my undergrad! (for job hunting reasons, for keeping-my-pool-open-reasons, I must declare this is irony)</li>\n<li>I&#39;m also listening to the book Lessons in Chemistry and I can&#39;t say I love a dog as a smart character but I do like how it portrays the sexist 50s in America, reminds me of Mad Men but finally having women (and scientist women) as main characters.</li>\n<li>Re-watching Attack on Titan because I missed those last episodes that were released a couple of years ago and I wanted to watch them in context. I love the show, it&#39;s a 10/10, and I want to read very smart interpretation pieces on it when I finish</li>\n</ul>\n",
    "lastModified": 1759940947789
  }
]