[
  {
    "slug": "20251008",
    "title": "A praise for Johnny do-it-all",
    "date": "2025-10-08",
    "tags": [
      "academia"
    ],
    "excerpt": "I was invited to give the graduation speech for the Engineering Department master programmes at the Universitat Pompeu Fabra, where I graduated 5 years ago. The speech is about being a Jack-of-all-trades in academia.",
    "content": "<p>Back in July I was invited to give the graduation speech for the Engineering Department master programmes at the Universitat Pompeu Fabra (where I did my master&#39;s!). There is a <a href=\"https://youtu.be/nNdj9rrQ3oY?si=hsjpGgDdh2z0g1uX&t=317\">video</a>, but you might prefer the transcription.</p>\n<h1>~~ A praise for Johnny do-it-all ~~</h1>\n<p>Hi, I&#39;m Teresa Pelinski and I graduated from the Sound and Music Computing Master&#39;s in 2021, that was 4 years ago. I actually didn&#39;t have a graduation neither for my undergrad or my master&#39;s because of COVID, so it&#39;s very exciting to be here and I am very thankful to Professor Xavier Serra for the invitation.</p>\n<p>Congratulations to all graduating students! If I&#39;m correct, most of you might still be working towards your master thesis – so I&#39;m sending you some strength in this last stretch! You probably have heard this before, but it is unlikely many people will read your full thesis, beginning to end, so I would concentrate on actually enjoying the work and learning, and going down the rabbit holes you&#39;re interested on rather than aiming for the perfect polished thesis.</p>\n<p>The programmes graduating today are Brain and Cognition, Cognitive Science and Interactive Media, Computational Biomedical Engineering, Intelligent Interactive Systems and Sound and Music Computing. And something all these programmes have in common is that they are all highly interdisciplinary fields. I can speak for Sound and Music Computing, which combines the already interdisciplinary fields of computation and music – it involves not only technical, scientific or engineering aspects, but also a great deal of humanities, like musicology or social sciences, and creative practice.</p>\n<p>I want to use my time today to talk about something some of you might be feeling, and is that you might not really know where you belong career-wise!</p>\n<p>Having ended up in these master programmes you might have studied very diverse things. So, for example, I studied Physics because I was interested in sound and maths, but I was always also interested in computers and art – so Physics was kind of unsatisfactory in this sense. Actually, at some point, early in my undergrad, I found out there was this marvellous and magic Sound and Music Computing master&#39;s here at UPF – I remember I actually found it because I was looking at some master or PhD&#39;s student thesis on acoustics. The SMC, the Sound and Music Computing programme was my comfort programme, it is the programme I would always google when I felt very drained from studying an undergrad I didn&#39;t feel was fully my thing. I did consider switching degrees, from Physics to something else, and I emailed Xavier in the second year of my Bachelors, a sort of panicked email, asking if I could access the master&#39;s with a Physics degree or if I should switch to computer science. He said Physics was fine, so thanks in part to Xavier, now I get to say I have a Physics degree, which I have to admit I like saying, even though I can&#39;t say I remember well what the thermodynamics laws are. So I did the SMC and later I moved to London to do my PhD in computer science, in particular in new musical instruments, which I am now close to finishing.</p>\n<p>Yet now I&#39;m not a physicist, not a computer scientist, not an engineer, not a musicologist, not a musician, not a sound artist, not a designer. I&#39;m a bit of all these things but none of them fully. I&#39;m what in English is called a Johnny do-it-all or a Jack of all trades. In Latin, a &quot;Johannes factotum&quot;, if you want to sound more elegant. This &quot;Jack of all trades&quot; phrase means someone who can do many things but is not a fully accomplished expert in neither of them, Jack from Jack of all trades is a generalist rather than a specialist. The phrase has been in use since the late 17th century and then, a century later, in the late 18th century, the phrase &quot;but master of none&quot; was added at the end. So, it was &quot;Jack of all trades dot dot dot but master of none&quot;. This &quot;master of none&quot; bit was added , according to Wikipedia, to make the statement &quot;less flattering to the person receiving it&quot;. So, Jack of all trades was used, at the time, in a derogatory manner. And I want to take this time to make a praise for Johnny do-it-all, for all these &quot;Jacks of all trades&quot;.</p>\n<p>I find being a Johnny do-it-all very confusing, especially now that I&#39;m finishing my PhD. I am constantly searching for postdocs, industry positions, I ask Chat GPT what job I should be looking for considering this soup of skills I have. And Chat GPT doesn&#39;t know, and neither do I. It feels that doing a postdoc in standard human-computer interaction would be killing that side of me that wants to talk about creative practice and critical theory. If I try to go along the more humanities, science and technology studies route, I&#39;m killing the &quot;maker&quot;/programmer in me. And if I go into industry then I am bowing to capitalist interests rather than the apparently pure pursue of knowledge Academia is offering to me. My researcher self would be going dead. It actually feels any path I take means killing a part of me. So, what do I do?</p>\n<p>I don&#39;t know what I do, if I knew, I would be doing it. I cannot talk about my or your future, but I can talk about how I think being a Jack of all trades (and yes, a master of none) has played in my favour in these last four years of my PhD.</p>\n<p>First of all, and this might be feel obvious, but it&#39;s still worth saying – be suspicious of anyone who lightly claims to be an expert at an early career stage. What they mean is that they know a lot about a specific topic, but to me an expert is not someone who knows everything, but someone who fully understands the complexity of the issue.</p>\n<p>Second, and here comes the interesting point, in interdisciplinary fields, to grasp that complexity you need to be able to navigate the terminology, narrative, discourses, backgrounds of many fields. What I am trying to say is, that, to be proficient in an interdisciplinary field you often need to be a Johnny do-it-all.</p>\n<p>My field is new interfaces for musical expression, shortened NIME. This is a field that deals with many aspects of designing new technology for making music, mostly in the experimental music space. Let me illustrate what I mean with having to be a Johnny do it all in NIME: An important question you need to ask yourself in this field, is, what are musical instruments, anyway? The first answer that comes to mind is that they are technology for making music. Yet technology often is functional, meaning, it has a specific and predefined purpose against which we can evaluate how good the technology is. So for example, a TV is for watching video, and we can evaluate the resolution of the screen, how well it reproduces the video. But how can we evaluate how good a musical instrument is? The answer is that there is no answer, that it is, as they say in social sciences, a wicked problem, a problem too complex to have a definite solution. Understanding this deeply requires to be not only a skilled technologist but also someone who engages with the philosophy of technology, design theory, artistic practice. It indeed requires to be a Jack of all trades.</p>\n<p>During my PhD I&#39;ve arrived questions that I felt were worth researching, that they were the important questions, however I could not answer them from the background I had. Fresh into my PhD I still remember all maths I had learnt in my Physics degree, and I knew a good deal of coding from my master&#39;s. Yet the big questions I encountered while working on my PhD had not much to do with this. I won&#39;t go into detail because I don&#39;t want to bore anyone talking about the specificities of my thesis, but it required me to go into artistic research, and read a good bunch of philosophy of science and of technology. And it was tough to understand those texts at first! But my particular background, my, you could say, epistemological position, that is, my knowledge of scientific practice, engineering, coding, has given me a unique point of view to discuss and talk about these texts. And that is a value! So this work I did in my thesis, that was kind of unrelated to my technical background I consider to be the best work I&#39;ve done in my thesis. I&#39;ve been of course lucky to have advisors who have given me the freedom to do this – sometimes you will need to fight a bit harder for that, but it&#39;s worth it, or it has been for me, at least.</p>\n<p>So you might now be feeling like, after this program, you know even less that what you started with – because you are starting to understand the complexity of your field, of the fields you are working with. But as I&#39;m telling you, becoming this Jack of all trades is the first step towards becoming a good researcher, practitioner, whatever you want to be. It can be uncomfortable at times to be asked what you&#39;re doing and what you are, career-wise, and not have words to answer. And I tell you it&#39;s okay, that will come, I think, it hasn&#39;t come for me yet, but I guess I&#39;m trusting the process.</p>\n<p>Congratulations again for the hard work you&#39;ve put and continue to put in your degree and best of luck with your future endeavours. Be proud to be a Johnny do-it-all, a Jack of all trades... and master of none.</p>\n",
    "lastModified": 1759945391230
  }
]